Project5/app/controllers/comments_controller.rb

  def new
  	@photo = Photo.find_by_id(params[:id])
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]

  def create
  	current_photo = Photo.find_by_id(params[:id])
  	@@new_comment = Comment.new
  	@@new_comment.photo_id = current_photo.id
  	@@new_comment.user_id = session[:current_user_id]
  	@@new_comment.date_time = Time.now.utc
  	@@new_comment.comment = params[:comment]
  	@@new_comment.save
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = 2 LIMIT 1
INSERT INTO "comments" ("comment", "created_at", "date_time", "photo_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["created_at", "2015-02-13 17:47:05.106828"], ["date_time", "2015-02-13 17:47:00.000000"], ["photo_id", 1], ["updated_at", "2015-02-13 17:47:05.106828"]]