Project5/app/controllers/comments_controller.rb

  def create
  	@comment = Comment.new(comment_params(params[:comment]))
  	if @comment.save
	  	redirect_to(:controller => :photos, :action => :index, :id => @comment.photo.user_id)
	else
      @comment.errors.full_messages.each do |mess|
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."comment" = 'test' LIMIT 1