Project5/app/controllers/users_controller.rb

	def index
  		@users = User.all()
---
SELECT "users".* FROM "users"

  	def post_login
  		if logged_in?
  			flash[:error] = "You are already logged in as #{current_user_full_name}"
  			redirect_to(:controller => :photos, :action => :index, :id => session[:current_user_id])
  		else
	  		current_user = User.find_by_login(params[:login])
---
SELECT  "users".* FROM "users"  WHERE "users"."login" = 'bieber' LIMIT 1

  	def create
      if logged_in?
        flash[:error] = "Logout before creating an account!"
        redirect_to(:controller => :photos, :action => :index, :id => session[:current_user_id])
        return
      end

  		new_user = User.new(user_params(params[:user]))

  		# Create new user and redirect to login page
  		if new_user.save
---
INSERT INTO "users" ("created_at", "first_name", "last_name", "login", "password_digest", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def password
        if !logged_in?
          flash[:error] = "Must log in to change password"
          redirect_to(:action => :login)
        else
          @user = User.find(current_user_id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

    def change_password
      #if not logged in, display error message
      if !logged_in?
          flash[:error] = "Must log in to change password"
          redirect_to(:action => :login)
      else
        current_user = User.find(current_user_id)
        if current_user.update(user_params(params[:user])) then
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "salt" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "cd33488a577c59e92ed3c56e86115842ab54479f"], ["salt", "0.006127304145982282"], ["updated_at", "2015-02-18 05:00:34.939781"]]